{
  "backend/main.mo": "Motoko canister storing bookings in a Map, allowing creation with duplicate checks and retrieval by month with sorting.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test identifiers.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens, dark mode variables, and global component styles.",
  "frontend/index.html": "Main HTML entry page with PWA manifest, theme color, iOS meta tags, and script bootstrap for the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining icons, names, theme colors, categories, and startup configuration.",
  "frontend/public/sw.js": "Service worker implementing caching of static assets, cache cleanup, and offline fallback behavior.",
  "frontend/src/App.tsx": "Root React component registering the service worker and rendering all sections including AppLinkArea and TroubleshootingPanel.",
  "frontend/src/components/AppLinkArea.tsx": "Component showing the current app URL with a copy-to-clipboard button and fallback text-selection behavior.",
  "frontend/src/components/AppShell.tsx": "Simple layout wrapper providing a centered max-width container with page padding.",
  "frontend/src/components/BookingForm.tsx": "Booking form with validation, month selection, backend submission, and success/error handling.",
  "frontend/src/components/BrandHeader.tsx": "Displays the site's brand header with logo, title, subtitle, and a hero image.",
  "frontend/src/components/ContactLocationSection.tsx": "Shows contact info including phone, WhatsApp, address, and a link to Google Maps.",
  "frontend/src/components/HotelsDistanceSection.tsx": "Lists hotel distance information for Mecca and Madina locations.",
  "frontend/src/components/InstagramSection.tsx": "Provides a button linking to the service's Instagram profile.",
  "frontend/src/components/MonthSlotPicker.tsx": "Renders a scrollable list of months allowing users to select one.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Displays a PWA install prompt with platform-specific instructions and install handling.",
  "frontend/src/components/TroubleshootingPanel.tsx": "Expandable panel offering troubleshooting steps for app access issues.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing on identity changes.",
  "frontend/src/hooks/useCreateBookingMutation.ts": "Provides a mutation for creating bookings via the backend actor and invalidates booking queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and stored identity handling.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Detects PWA installability, handles beforeinstallprompt events, and manages install prompts.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark OKLCH theme variables plus base styles.",
  "frontend/src/lib/slugify.ts": "Provides a slugify function enforcing an ICP-safe 5–50 char hostname label and a helper returning the app slug.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge Tailwind and conditional class names using clsx and twMerge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load and logs registration success or failure.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, plugins, container settings, and animations.",
  "project_state.json": "Describes project state, requirements, known issues, and architecture notes for the Azhari Tours & Travels mobile app."
}