{
  "backend/main.mo": "Motoko actor storing bookings in a map with create and month-filtered query functions.",
  "feature_evidence.json": "Feature evidence report mapping PWA-related features to source files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend files.",
  "frontend/index.css": "Tailwind base file defining OKLCH color variables for light/dark themes and global styling.",
  "frontend/index.html": "HTML entry point including PWA manifest, theme meta tags, iOS web app tags, and root mount point.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and standalone display mode.",
  "frontend/public/sw.js": "Service worker caching static assets and providing offline support with cache-first logic.",
  "frontend/src/App.tsx": "Main React app registering the service worker and rendering core sections including PWA prompt.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing centered, padded container for the app.",
  "frontend/src/components/BookingForm.tsx": "Booking form with validation, month picker, submission to backend, and success/error UI states.",
  "frontend/src/components/BrandHeader.tsx": "Brand header showing logo, title, subtitle, and hero banner image.",
  "frontend/src/components/ContactLocationSection.tsx": "Displays phone, WhatsApp, and address details with a link to Google Maps.",
  "frontend/src/components/HotelsDistanceSection.tsx": "Shows distance info for Mecca and Madina hotels.",
  "frontend/src/components/InstagramSection.tsx": "Provides a button linking users to follow the project's Instagram profile.",
  "frontend/src/components/MonthSlotPicker.tsx": "Renders a scrollable month selector with highlight for the chosen month.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Shows a PWA install prompt with iOS instructions or install button based on device.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useCreateBookingMutation.ts": "Provides a mutation for creating bookings through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Detects installability and handles Android and iOS PWA install flows.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load for PWA support.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, content scanning, extended color system via OKLCH vars, custom animations, fonts, shadows, and plugin setup.",
  "project_state.json": "Project state metadata describing app requirements, features, icons, and architectural notes for a mobile booking app."
}