{
  "kind": "build_request",
  "title": "Fix shareable app URL and handle “Canister ID Not Resolved (Error 400)”",
  "projectName": "Azhari Tours & Travels",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Add an in-app “App Link” area that shows the current app URL (window.location.origin) and provides a one-tap Copy button so users can reliably share the exact working link from their device/browser.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "give the link of pwa",
          "this link (https://azhari-tours-travels.icp0.io) is not open"
        ]
      },
      "acceptanceCriteria": [
        "When the app loads successfully, the UI displays the current origin (e.g., https://<host>) in a readable format.",
        "A “Copy Link” button copies the displayed URL to the clipboard and shows a success confirmation.",
        "If clipboard APIs are unavailable, the UI provides a fallback (e.g., selects the text for manual copy) without crashing."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Add a user-facing troubleshooting panel for gateway resolution failures that explicitly addresses “Canister ID Not Resolved (Error 400)” and instructs users to try alternative networks/browsers, and to open the app using the exact link shown in the new “App Link” area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Canister ID Not Resolved (ERROR 400)",
          "THIS WILL SHOW"
        ]
      },
      "acceptanceCriteria": [
        "The troubleshooting content includes the exact error phrase “Canister ID Not Resolved (Error 400)” (English).",
        "The troubleshooting panel includes clear steps: try another browser, switch Wi‑Fi/mobile data, disable VPN, and use the exact copied link from the app.",
        "The troubleshooting UI is mobile-friendly and does not block core booking functionality when the app is otherwise working."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Use the user-provided desired domain text “azhari tours & travels” to derive a valid ICP-friendly slug (letters/numbers/hyphens only; no spaces or ampersands) and surface that slug in a small admin/developer note inside the UI (for example in the footer) so the intended canonical hostname is unambiguous during deployment/link sharing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "azhari tours & travels"
        ]
      },
      "acceptanceCriteria": [
        "The app derives and displays a slugified hostname label from “azhari tours & travels” (e.g., “azhari-tours-travels”).",
        "The derived slug contains only lowercase letters, numbers, and hyphens and is between 5 and 50 characters.",
        "No existing immutable-path files are edited to implement this UI note."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files in frontend/src/components/ui (compose them instead).",
    "Keep the backend as a single Motoko actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Publishing the app to Google Play Store or Apple App Store (wrapping PWA into AAB/iOS container) is out of scope for this build request.",
    "Changing booking data model or backend booking APIs is out of scope for this build request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for user-facing text"
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}