{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix shareable app URL and add user troubleshooting for ICP gateway resolution errors",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Add an in-app “App Link” area that displays the current app origin and supports one-tap copy with a safe fallback.",
      "acceptanceCriteria": [
        "When the app loads successfully, the UI displays the current origin (e.g., https://<host>) in a readable format.",
        "A “Copy Link” button copies the displayed URL to the clipboard and shows a success confirmation.",
        "If clipboard APIs are unavailable, the UI provides a fallback (e.g., selects the text for manual copy) without crashing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLinkArea.tsx",
          "operation": "create",
          "description": "Create an in-app “App Link” UI section that reads window.location.origin, renders it in a selectable/readable field, and provides a “Copy Link” action using navigator.clipboard when available with a manual-copy fallback (select text + instructions) when unavailable. Use shadcn-ui (e.g., Card/Button/Input or similar) to keep styling consistent; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new AppLinkArea into the existing single-page flow (no new routes), placing it in a visible, mobile-friendly location (e.g., near the PWA prompt) so users can reliably copy the working URL. If using shadcn-ui layout components, verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Add a mobile-friendly troubleshooting panel that addresses “Canister ID Not Resolved (Error 400)” and suggests practical steps without blocking bookings.",
      "acceptanceCriteria": [
        "The troubleshooting content includes the exact error phrase “Canister ID Not Resolved (Error 400)” (English).",
        "The troubleshooting panel includes clear steps: try another browser, switch Wi‑Fi/mobile data, disable VPN, and use the exact copied link from the app.",
        "The troubleshooting UI is mobile-friendly and does not block core booking functionality when the app is otherwise working."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TroubleshootingPanel.tsx",
          "operation": "create",
          "description": "Create a user-facing troubleshooting panel component that includes the exact phrase “Canister ID Not Resolved (Error 400)” and presents clear steps (try another browser, switch Wi‑Fi/mobile data, disable VPN, and open the app using the exact link shown in the App Link area). Implement as a non-blocking, collapsible/compact section using shadcn-ui (e.g., Card/Button) so it remains mobile-friendly; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render the TroubleshootingPanel within the existing page (no new routes) in a position that is discoverable but not intrusive (e.g., below the App Link area or near the footer), ensuring booking remains usable. If composing with shadcn-ui components, verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Derive and display an ICP-friendly slug from “azhari tours & travels” as a small admin/developer note in the UI.",
      "acceptanceCriteria": [
        "The app derives and displays a slugified hostname label from “azhari tours & travels” (e.g., “azhari-tours-travels”).",
        "The derived slug contains only lowercase letters, numbers, and hyphens and is between 5 and 50 characters.",
        "No existing immutable-path files are edited to implement this UI note."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/slugify.ts",
          "operation": "create",
          "description": "Add a small utility that slugifies the string “azhari tours & travels” into an ICP-friendly label (lowercase letters/numbers/hyphens only, no spaces/ampersands), enforcing a 5–50 character constraint (e.g., trim/collapse hyphens and clamp safely)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the existing footer area to include a small admin/developer note that displays the derived slug (e.g., “Deployment slug: azhari-tours-travels”) to make the intended canonical hostname unambiguous. Keep changes limited to App.tsx and new files (do not edit the restricted hooks, main entry, or any files in frontend/src/components/ui)."
        }
      ]
    }
  ]
}